app/Controllers/Service/Usuarios.php

    public function show($id = null)
    {

        $model =  model('UsuariosModel');
        $lista = $model->where('id_usuario', $id)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1'
 LIMIT 1